In [44]:
import pandas as pd
import sqlalchemy

In [45]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:manager@localhost:3306/py_mysql_example')

In [46]:
df=pd.read_sql_table('customers',engine)
df

   id name   phone
0   1    a  999999
1   1    a   88888
2   1    a   77777

In [47]:
df=pd.read_sql_table('customers',engine,columns=['name'])
df

  name
0    a
1    a
2    a

In [48]:
query='''
select c.name,o.name from customers c inner join orders o on o.id=c.id
'''
df=pd.read_sql_query(query,engine)
df

  name name
0    a    x
1    a    x
2    a    x
3    a    y
4    a    y
5    a    y

In [49]:
df=pd.read_csv('customers.csv')
df.head()

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543

In [50]:
df.rename(columns={
    'Customer Name':'name',
    'Customer Phone':'phone'
},inplace=True)
df.head()

              name       phone
0     rafael nadal  4567895647
1  maria sharapova   434534545
2   vladimir putin    89345345
3      kim un jong   123434456
4       jeff bezos   934534543

In [51]:
df.to_sql(
name='customers',con=engine,index=False,if_exists='append'
)

In [52]:
pd.read_sql('customers',engine)

    id             name       phone
0  1.0                a      999999
1  1.0                a       88888
2  1.0                a       77777
3  NaN     rafael nadal  4567895647
4  NaN  maria sharapova   434534545
5  NaN   vladimir putin    89345345
6  NaN      kim un jong   123434456
7  NaN       jeff bezos   934534543
8  NaN     rahul gandhi    44324222

In [53]:
query='''
select * from customers where name='a';
'''

In [54]:
pd.read_sql(query,engine)

   id name   phone
0   1    a  999999
1   1    a   88888
2   1    a   77777